# Lab|Subsetting_And_DescriptiveStats

# Before your start:
. Remember that you just need to do one of the challenges.

. Keep in mind that you need to use some of the functions you learned in the previous lessons.

. All datasets are provided in IronHack's database.

. Elaborate your codes and outputs as much as you can.

. Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!

. Import all the necessary libraries here:

In [ ]:
Import all the necessary libraries here:

In [6]:
#Import the necessary libraries here:
import pandas as pd
import numpy as np
import random
from scipy import stats

# Remove warnings (not necessary)
import warnings
warnings.filterwarnings('ignore')

# Data visualization
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import plotly.graph_objects as go
%matplotlib inline

# [ONLY ONE MANDATORY] Challenge 2

# Load the employees dataset into a dataframe. Call the dataframe employees.

In [9]:
employee_df = pd.read_csv("Employee.csv")
employee_df

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [10]:
# Standardize column names to lowercase
employee_df.columns = employee_df.columns.str.lower()
employee_df

     name department education gender      title  years  salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

# Explore the data types of the employees dataframe. Comment your results.

In [11]:
employee_df.dtypes

name          object
department    object
education     object
gender        object
title         object
years          int64
salary         int64
dtype: object

#
In "employee_df" columns like name, department, education, gender, and title are of type object, which typically 
represents strings.

years and salary are of type int64, which represents integer values.
These datatypes seems fine for the columns based on the type od data they contain.

# What's the average salary in this company?

In [12]:
employee_df.shape # wanted to check the total records

(9, 7)

In [13]:

average_salary = employee_df['salary'].mean()

In [14]:
# Print the average salary
print("Average Salary:", average_salary)

Average Salary: 48.888888888888886

# What's the highest salary?

In [15]:
highest_salary = employee_df['salary'].max()

# Print the lowest salary
print("Highest Salary:", highest_salary)

Highest Salary: 70

In [16]:
# Print the highest salary
print("Highest Salary:", highest_salary)

Highest Salary: 70

# What's the lowest salary?

In [17]:
lowest_salary = employee_df['salary'].min()

In [18]:
# Print the lowest salary
print("Lowest Salary:", lowest_salary)

Lowest Salary: 30

# Who are the employees with the lowest salary?

In [19]:
lowest_salary_employees = employee_df[employee_df['salary'] == lowest_salary]

# using boolean indexing to filter the rows where the "salary" column matches the lowest_salary value.

In [20]:
# Print the employees with the lowest salary
print("Employees with the Lowest Salary:")
display(lowest_salary_employees)

Employees with the Lowest Salary:

    name department education gender    title  years  salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

# Find all the information about an employee called David.

In [21]:
david_employee_info = employee_df[employee_df['name'] == 'David']

# Print the information about the employee named David
print("Employee Information for David:")
print(david_employee_info)

Employee Information for David:
    name department education gender    title  years  salary
2  David         HR    Master      M  analyst      2      30

# Could you return only David's salary?

In [22]:
# Filter rows where the name is "David" and select the "salary" column
david_salary = employee_df.loc[employee_df['name'] == 'David', 'salary'].values[0]

# Print David's salary
print("David's Salary:", david_salary)

David's Salary: 30

In [24]:
#1.using boolean indexing to filter the rows where the "name" column matches the value "David."

#2.Then using .loc to select the "salary" column for those filtered rows.

#3.Finally, using .values[0] to access the first (and only) value in the resulting Series, which represents David's salary.

# Print all the rows where job title is associate.

In [25]:
title_associate = employee_df[employee_df['title'] == 'associate']

# Print all rows with the job title "Associate"
print("Employees with the Title 'Associate':")
print(title_associate)

Employees with the Title 'Associate':
     name department education gender      title  years  salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

# Print the first 3 rows of your dataframe.
Tip: There are 2 ways to do it. Do it both ways.

In [27]:
# Method 1
employee_df.head(3)

    name department education gender    title  years  salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [28]:
# Method 2
employee_df[:3] #Using indexing

    name department education gender    title  years  salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

# Find the employees whose title is associate and whose salary is above 55.

In [29]:

associate_above_55 = employee_df[(employee_df['title'] == 'associate') & (employee_df['salary'] > 55)]

# Print employees who meet both conditions
print("Employees with Title 'Associate' and Salary > 55:")
display(associate_above_55)

Employees with Title 'Associate' and Salary > 55:

    name department education gender      title  years  salary
7  Pedro         IT       Phd      M  associate      7      60

In [30]:
# Using boolean indexing with multiple conditions. The & operator is used to combine the conditions so that we 
#filter rows where both conditions are true.

# Group the employees by number of years of employment. What are the average salaries in each group?

In [31]:
average_salaries_by_years = employee_df.groupby('years')['salary'].mean()

# Print the average salaries in each group
print("Average Salaries by Years of Employment:")
display(average_salaries_by_years)

Average Salaries by Years of Employment:

years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: salary, dtype: float64

# What is the average salary per title?

In [32]:
average_salary_per_title = employee_df.groupby('title')['salary'].mean().reset_index()

# Print the average salary per title
print("Average Salary Per Title:")
display(average_salary_per_title)

Average Salary Per Title:

       title     salary
0         VP  70.000000
1    analyst  32.500000
2  associate  56.666667

# Find the salary quartiles.

In [34]:

# Calculate the first quartile (Q1, 25th percentile)
Q1 = employee_df['salary'].quantile(0.25)

# Calculate the second quartile (Q2, median, 50th percentile)
Q2 = employee_df['salary'].quantile(0.50)

# Calculate the third quartile (Q3, 75th percentile)
Q3 = employee_df['salary'].quantile(0.75)

# Print the quartiles
print("Salary Quartiles:")
print("Q1 (25th Percentile):", Q1)
print("Q2 (Median, 50th Percentile):", Q2)
print("Q3 (75th Percentile):", Q3)

Salary Quartiles:
Q1 (25th Percentile): 35.0
Q2 (Median, 50th Percentile): 55.0
Q3 (75th Percentile): 60.0

# Is the mean salary different per gender?

In [36]:
# Calculate the mean salary for each gender
mean_salary_by_gender = employee_df.groupby('gender')['salary'].mean()

# Print the mean salary by gender
print("Mean Salary by Gender:")
display(mean_salary_by_gender)

Mean Salary by Gender:

gender
F    47.5
M    50.0
Name: salary, dtype: float64

In [ ]:
#yes, as per above results mean salary seems different per gender.

# Find the minimum, mean and maximum of all numeric columns for each company department.

In [38]:

# Group the data by department and calculate statistics for numeric columns
department_stats = employee_df.groupby('department').agg({'salary': ['min', 'mean', 'max'], 'years': ['min', 'mean', 'max']})

# Print the department-wise statistics
print("Department-wise Statistics:")
display(department_stats)

Department-wise Statistics:

           salary            years
              min   mean max   min      mean max
department
HR             30  45.00  70     2  4.666667   8
IT             30  48.75  70     1  4.500000   8
Sales          55  55.00  55     2  2.500000   3

In [ ]:
Bonus Question: for each department, compute the difference between the maximum and the minimum salary.
Hint: try using agg or apply combined with lambda functions.

In [44]:
# Define a custom aggregation function to compute the salary difference
salary_difference = lambda x: x.max() - x.min()

In [40]:
# Group the data by department and apply the custom function to the 'salary' column
department_salary_difference = employee_df.groupby('department')['salary'].agg(salary_difference)

In [42]:
# Print the department-wise salary differences
print("Department-wise Salary Differences:")
display(department_salary_difference)

Department-wise Salary Differences:

department
HR       40
IT       40
Sales     0
Name: salary, dtype: int64